Revit 2024 API
BuiltInFailures.StairRampFailures.IntermediateLandingHigherThanTopRunFailure Property
 Run is reversed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IntermediateLandingHigherThanTopRunFailure { get; }
Visual Basic
Public Shared ReadOnly Property IntermediateLandingHigherThanTopRunFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IntermediateLandingHigherThanTopRunFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace